app/controllers/helloworldposts_controller.rb

  def index
    @helloworldposts = Helloworldpost.all
---
SELECT `helloworldposts`.* FROM `helloworldposts`

  def create
    @helloworldpost = Helloworldpost.new(helloworldpost_params)

    respond_to do |format|
      if @helloworldpost.save
---
INSERT INTO `helloworldposts` (`title`, `description`, `created_at`, `updated_at`) VALUES ('Na Na', 'name for ', '2019-06-10 08:28:02', '2019-06-10 08:28:02')

  def update
    respond_to do |format|
      if @helloworldpost.update(helloworldpost_params)
---
UPDATE `helloworldposts` SET `title` = 'Lorems', `description` = 'Loream hould contain all the record creation needed to seed the database with its default values.# The data can then be loaded with the rails db:seed command or created alongside ', `updated_at` = '2019-06-07 09:25:20' WHERE `helloworldposts`.`id` = 1

    def set_helloworldpost
      @helloworldpost = Helloworldpost.find(params[:id])
---
SELECT  `helloworldposts`.* FROM `helloworldposts` WHERE `helloworldposts`.`id` = 1 LIMIT 1